;;; packages.el -*- lexical-binding: t; -*-

;; (package! centered-window-mode :ignore t)

(package! orgit)
(package! evil-magit)
(package! magithub)
;; (package! magit-todos)

(package! tldr)
(package! keyfreq)

(package! graphviz-dot-mode)
(package! whitespace-cleanup-mode)

(package! atomic-chrome)

;; for python lang
(package! lsp-python)
(package! py-isort)
(package! pipenv)
(package! yapfify :recipe (:fetcher github :repo "JorisE/yapfify"))

(package! electric-operator)

(package! counsel-tramp)
(package! docker-tramp)

(package! drag-stuff)
(package! restart-emacs)

(package! sx)

(package! discover-my-major)
(package! list-environment)
(package! diffview)
(package! try)
(package! ztree)

